<template lang="html">
<div>
    <h1 class="page-header">文本规范</h1>
<markdown>
### 释义

文本包含系统中所有的文本展示

### 范围

包含但不限于：系统数据展示、用户引导提示、错误提示、信息显示辅助说明(如标题)、按钮文字等

### 整体文案风格

**简洁:** 内容简洁，字数尽量少，避免冗余

**易懂:** 文字易理解，拒绝个性化或不统一

**颜色:** 文字的颜色和其意义符合，需遵循`设计风格-颜色`

---

### 常用格式

常用格式定义了日常的信息展示方式

### 统一交互

#### 日期

**分隔符:** '-'

**小时制:** 24小时制

#### 状态类

**可用状态:** 如已启用、已生效、已通过

**不可用状态:** 如已禁用、未生效、已驳回

**挂起状态:** 如测试中、待领取

#### 并列信息(id/name同时展示)

分隔符: ' | '

**两个信息:** 对于两个信息并列的情况，采用id | name

**多信息** 对于多个信息并列的情况，采用id | code | name

---

约定：

1. 默认情况下，当有以下类型操作时，请使用下面列出的文本，避免出现类似的文本。

2. 当不足以表现其作用时，可以根据业务添加一些文字，如 `添加XXXX`、`编辑XXXX`。

### 操作类型

#### 1. 添加

新增一项数据

**类似文本：**新建、新增

#### 2. 编辑

编辑一项数据；“编辑”即编辑该项数据，或“编辑XXXX”编辑该项数据的局部数据或其中的某个属性数据，如“编辑标签”

**类似文本：**修改

#### 3. 查看[XXXX]

查看一项数据的详细信息

**类似文本：**详细信息

#### 4. 启用

将一项数据的状态变为“可使用”的状态

**类似文本：**开启、使用、激活、生效

#### 5. 禁用

将一项数据的状态变为“禁用中”

**类似文本：**关闭

#### 8. 删除

删除一项数据

**类似文本：**清除、清空

#### 9. 保存

保存一个表单，保存内容，一般都要进行数据提交

**类似文本：**确定，提交

#### 10. 取消

取消编辑，关闭弹窗，经常和“保存”一起出现

#### 11. 提交审核

将数据提交至审核处

#### 12. 补发

一般是奖品的补发

#### 13. 导入XXXX

导入一个文件，如“导入CSV文件”

**类似文本：**上传

#### 14. 导出

将信息导出为一个文件

**类似文本：**下载

#### 15. 搜索

搜索符合条件的内容

**类似文本：**查询

#### 16. 预览

预览数据时，一般为数据配置后对前台产生的影响
预览图片时，即查看原图

**类似文本：**查看

#### 17. 切换[XXXX]

两种状态间的实时转换

**类似处理：**tab页(IOS/Android)

#### 18. XXXX配置

对数据进行另一维度的配置，如当前是补丁数据列表，加入“补丁投放配置”操作对单个补丁做投放的配置

**类似文本：**XXXX、XXXX设置

---

### 报错信息

#### 非空报错

没有填写/选择

##### 语法

请选择
请填写

#### 长度报错

字符长度超限/不足

##### 语法

只能为X~XX个字符
不能小于XXX个字符
不能大于XXX个字符

#### 格式报错

内容与要求的格式不符

##### 语法

只能为XXXX
必须包含XXX和XXX

#### 系统报错

通常需要和数据库匹配

##### 语法
　　
XXXX错误
XXXX已被占用，请使用其它的
XXXX错误，您共有n次机会，现在还有n-1次机会

**特别说明:** 提示信息的最后不加标点符号

---

### select第一项

推荐根据场景使用如下三项：不限 全部 请选择

### 数据为空

前端默认展示为空，而非'-'等。

例如表格中有些信息后端返回是空的
</markdown>
</div>
</template>

<script>
import Markdown from 'common/markdown';
export default {
    components: {
        Markdown
    }
};
</script>

<style lang="css">
</style>
